package ecosystem.commands;
import ecosystem.core.Environment;

/**
 * ממשק הבסיס המייצג פקודה הניתנת לביצוע על עולם הסימולציה
 * ממשק זה מהווה חלק מתבנית העיצוב קומנד ומאפשר לישויות השונות לייצר בקשות לפעולות ולהכניס אותן לתור המרכזי של המנוע במקום לשנות את המודל ישירות מהתהליכונים שלהן
 */
public interface WorldCommand {
    /**
     * מבצעת את הפקודה הספציפית על סביבת העולם בצורה מסונכרנת ובטוחה
     * @param env סביבת העולם שעל גביה מופעלת לוגיקת הפקודה ומתעדכנים מבני הנתונים
     * @return true אם הפעולה בוצעה בהצלחה והושלמה במלואה או false אם התנאים לביצוע הפקודה לא התקיימו
     */
    boolean execute(Environment env);
}
